<?php
/**
 +------------------------------------------------------------------------------
 * URL路由配置文件
 +------------------------------------------------------------------------------
 * @version   1.0
 * @author    WangXian
 * @filename ./conf/main.config.php
 * @creation date 2010-8-25 10:54:17
 +------------------------------------------------------------------------------
 */
return array(
	//一个路由模块中，可有多个规则，优先匹配第一个规则。
	'test'=>
	 array
	 (
		array('|/test/(\d+)|','/test/test/your_type/$1'),
	 ),
	
	'archives'=>
	 array
	 (
		array('|^/archives/(\d+).html$|','/index/test/your_id/$1.html'),
	 ),
);