<?php
/**
  +------------------------------------------------------------------------------
 * 扩展类示例
  +------------------------------------------------------------------------------
 * @Version  3.5
 * @Author   WangXian
 * @E-mail    admin@loopx.cn
 * @Creation  date 2011-07-28 10:23:50
 * @Modified  date 2011-07-28 10:23:50
  +------------------------------------------------------------------------------
 */

class abc
{
	public function test()
	{
		return '我被调用了！';
	}

	public static function show()
	{
		return 'i think... you are....!!!';
	}
}
