<?php
 /**
 +------------------------------------------------------------------------------
 * 测试挂件
 +------------------------------------------------------------------------------
 * @version 3.0
 * @author  WangXian
 * @email	<admin@loopx.cn>
 * @creation date 2011-6-5 上午01:49:41
 * @last modified 2011-6-5 上午01:49:41
 +------------------------------------------------------------------------------
 */

class mytestWidget extends Widget
{
	//挂件中必须包含一个run的接口方法，不然无法运行。参数为$data=''
	public function run($data='')
	{
		$this->view->data = $data;
		$this->view->render();
	}
}